SSAD/test/web-app/build/docs/imp/runtime/components/guard/get_role_set_in_system/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>Get-role-set</code> route of the <code>Guard</code> component</title>
<!-- 2017-08-31 Thu 18:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
</head>
<body>
<div id="content">
<h1 class="title"><code>Get-role-set</code> route of the <code>Guard</code> component</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Checks</a></li>
<li><a href="#sec-3">3. Implementation</a>
<ul>
<li><a href="#sec-3-1">3.1. Imports and class <code>GetRoleSet</code></a></li>
<li><a href="#sec-3-2">3.2. The type structure of the <code>get_role_set_in_system</code> route</a></li>
<li><a href="#sec-3-3">3.3. The <code>do</code> method</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Checks</a>
<ul>
<li><a href="#sec-4-1">4.1. Type checks</a></li>
<li><a href="#sec-4-2">4.2. Authorization check</a></li>
<li><a href="#sec-4-3">4.3. State check</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the specification and implementation of the
<code>get_role_set_in_system</code> route of the <code>Guard</code> component.  
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Checks</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> TypeCheck </dt><dd>Check whether the instruction consists of
the command <code>get_role_set_in_system</code> and additionally contains a
session object (and nothing else).  The typecheck may
be implemented by consulting the <a href="../../../datatypes/instr/index.html">instruction datatype</a>
specification.
</dd>
</dl>


<dl class="org-dl">
<dt> AuthCheck </dt><dd>Check whether the role in the instruction's
session is either <code>user</code> or <code>admin</code>.  (This will
always be true since a session's role must either be
equal to <code>Role.user</code> or an <code>Role.admin</code>.
</dd>
</dl>


<dl class="org-dl">
<dt> StateCheck </dt><dd>Check whether the session in the
instruction is indeed an entity currently present in
the entity manager's session aggregate.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Implementation</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Imports and class <code>GetRoleSet</code></h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">import</span> traceback
<span style="font-weight: bold;">from</span>  runtime.exceptions.app.exception <span style="font-weight: bold;">import</span> AppException
<span style="font-weight: bold;">from</span> runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> check_pred
<span style="font-weight: bold;">from</span> runtime.datatypes.cmd.cmd <span style="font-weight: bold;">import</span> Cmd
<span style="font-weight: bold;">from</span> runtime.objects.session.session <span style="font-weight: bold;">import</span> Session
<span style="font-weight: bold;">from</span> runtime.datatypes.instr.get_role_set_in_system.get_role_set_in_system_instr <span style="font-weight: bold;">import</span> GetRoleSetInstr

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">GetRoleSet</span>:
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The type structure of the <code>get_role_set_in_system</code> route</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The <code>get_role_set_in_system</code> route is a dictionary with 'cmd' equal to
<code>Cmd.get_role_set_in_system</code> and a 'session' that is an instance of
<code>Session</code>.
</p>

<pre class="example">
instr = {'cmd': Cmd.get_role_set_in_system, 'session': Session.is_inst}
</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The <code>do</code> method</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The <code>do</code> method simply does all the checks.  
</p>
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span> 
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">do</span>(component, instr):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"get_role_set_in_system: %s"</span> % instr

        GetRoleSet.check_type(instr)
        GetRoleSet.check_auth(component, instr)
        GetRoleSet.check_state(component, instr)
        <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Checks</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Type checks</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Check if the the instruction is of the correct shape,
i.e. satisfies the predicate <code>GetRoleSetInstr.is_inst</code>.
</p>
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_type</span>(instr):
        check_pred(GetRoleSetInstr.is_inst)(instr)
        <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Authorization check</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Check whether the role in the instruction's session is either <code>user</code>
or <code>admin</code>.  (This will always be true since a session's role must
either be equal to <code>Role.user</code> or an <code>Role.admin</code>.
</p>
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_auth</span>(component, instr):
        <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> State check</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This check passes if the session is already an entity
present in the entity manager.  Otherwise an <code>AppException</code>
is raised.
</p>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_state</span>(component, instr):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> component.em.is_present(instr[<span style="font-style: italic;">'session'</span>]):
            <span style="font-weight: bold;">raise</span> AppException(op=<span style="font-style: italic;">"get_role_set_in_system.chec_state"</span>,
                                   msg=<span style="font-style: italic;">"session is not in the entity manager"</span>)

        <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-07-11 Tue]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-08-31 Thu 18:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
